In [1]:
import pandas as pd

In [2]:
#File path
csv_path="Resources\purchase_data.csv"

In [3]:
#Reading CSV file
game_data=pd.read_csv(csv_path)

In [20]:
#data display
game_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [21]:
#finding the unique players using "SN" column
unique_players = game_data["SN"].unique()

In [22]:
unique_players

array(['Lisim78', 'Lisovynya38', 'Ithergue48', 'Chamassasya86',
       'Iskosia90', 'Yalae81', 'Itheria73', 'Iskjaskst81', 'Undjask33',
       'Chanosian48', 'Inguron55', 'Haisrisuir60', 'Saelaephos52',
       'Assjaskan73', 'Saesrideu94', 'Lisassa64', 'Lisirra25',
       'Zontibe81', 'Reunasu60', 'Chamalo71', 'Iathenudil29',
       'Phiarithdeu40', 'Siarithria38', 'Eyrian71', 'Siala43',
       'Lisirra87', 'Lirtossa84', 'Eusri44', 'Aela59', 'Tyida79',
       'Idai61', 'Farusrian86', 'Aeralria27', 'Haillyrgue51', 'Sondim73',
       'Jeyciman68', 'Idaisuir85', 'Seuthep89', 'Reulae52',
       'Sondilsaya62', 'Aerithriaphos45', 'Assosia88', 'Aidaillodeu39',
       'Aelly27', 'Tyeosri53', 'Haerith37', 'Yasrisu92', 'Chanuchi25',
       'Asur96', 'Iaralrgue74', 'Chanosia34', 'Aelin32', 'Ilosianya35',
       'Zhisrisu83', 'Phaelap26', 'Raesty92', 'Palyon91', 'Tyisur83',
       'Yaliru88', 'Yadanu52', 'Jiskimya77', 'Yadaphos40', 'Alo38',
       'Phaena87', 'Chamirraya83', 'Chanastsda67', 'Indonmol95',
       'Jiskossa61', 'Pheodai94', 'Hari50', 'Marilsa69', 'Assistasda42',
       'Lisosia93', 'Philodil43', 'Mindadaran26', 'Lirtosia63',
       'Assjaskan56', 'Irithlis29', 'Heudai45', 'Haerithp41', 'Aina42',
       'Jiskjask60', 'Umolrian85', 'Qarirwen82', 'Laedallo55',
       'Eoralrap26', 'Undosian34', 'Chadolyla44', 'Chadistaya75',
       'Yathedeu43', 'Aina43', 'Ilassast39', 'Lisassala98', 'Aiduecal76',
       'Chadossa89', 'Pheodaisun84', 'Heollyriap59', 'Maropast28',
       'Frichim77', 'Thryallym62', 'Eulanurin88', 'Lassjaskan73',
       'Tyaerith73', 'Sondadarya58', 'Hirirap39', 'Ririp86', 'Sundim98',
       'Iskichinya81', 'Phyali88', 'Undirrala66', 'Nitherian58',
       'Lassilsala30', 'Frichaststa61', 'Frichosia58', 'Ilosia37',
       'Lisista27', 'Seudaillorap38', 'Aesty53', 'Yathecal82',
       'Lisossanya98', 'Iral74', 'Lisast87', 'Maridisya31', 'Jiskassa76',
       'Ethriel85', 'Iskirra45', 'Iri67', 'Rarallo90', 'Lisasi93',
       'Adastirin33', 'Eyista89', 'Ili43', 'Chamirra53', 'Hailaphos89',
       'Iskadarya95', 'Qilatista90', 'Inasti31', 'Marilsanya48',
       'Marjask87', 'Chanjaskan89', 'Hyaduesu61', 'Aillyrin83',
       'Marast30', 'Sundadar27', 'Tyaelorap29', 'Lirtimst73',
       'Styaduen40', 'Sidap51', 'Chanastst38', 'Lirtassa52', 'Sondim68',
       'Aeral97', 'Heosurnuru52', 'Lisopela58', 'Caesrinusuir82',
       'Tyirinu79', 'Fironon91', 'Lassjask63', 'Indcil77', 'Chamimla73',
       'Syathe73', 'Baelollodeu94', 'Mindista32', 'Saena74',
       'Marirrasta50', 'Lamil79', 'Aenarap34', 'Aisur51', 'Thrientossa55',
       'Chadista79', 'Tyeurith29', 'Malunil62', 'Hiasri33', 'Lisadar44',
       'Frichjask31', 'Lisjaskya84', 'Ristydru66', 'Frichast28',
       'Minduri31', 'Maradaran90', 'Mindetosya30', 'Ialallo29',
       'Pheusrical25', 'Chanosia60', 'Phistym51', 'Aelollo59',
       'Chamimla85', 'Haisurra41', 'Sondastsda82', 'Qilanrion65',
       'Eulasuir89', 'Eosrirgue62', 'Shaidanu32', 'Lirtastan49',
       'Iaralsuir44', 'Tyeudariasuir90', 'Cosadar58', 'Aelastirin39',
       'Aidai53', 'Jiskjask85', 'Ealrion88', 'Chamjask73', 'Tyaenasti87',
       'Alim85', 'Haeladil46', 'Jiskirran77', 'Undosia27', 'Peorith44',
       'Yarithsurgue62', 'Taeduenu92', 'Rairin89', 'Aerithriaphos46',
       'Idairin51', 'Lisista54', 'Eodailis27', 'Lirtastsda29',
       'Undilsan50', 'Eodaisu60', 'Quaranmol58', 'Lirtossa60',
       'Lirtilsa71', 'Isursuir31', 'Sundirrala66', 'Saerallora71',
       'Iasur80', 'Tyaelo67', 'Quanunwen42', 'Yasur35', 'Assehoan67',
       'Haellysu29', 'Saida58', 'Chamadar79', 'Aeral43', 'Lirtirra37',
       'Tyidaim51', 'Lassassast73', 'Assassasta79', 'Heollyra92',
       'Anallorgue57', 'Aerithllora36', 'Smaistysu35', 'Ennalmol65',
       'Yarithrgue83', 'Yana46', 'Sondimla25', 'Aidai61', 'Wailin72',
       'Firan91', 'Alaesu91', 'Aellynun67', 'Rilaera56', 'Eulaestira36',
       'Marim28', 'Idastidru52', 'Ilirrasda54', 'Alaephos75',
       'Syalollorap93', 'Minduli80', 'Chanastya70', 'Frichadaran88',
       'Siallylis44', 'Aeri84', 'Iasursti71', 'Mindilsa34', 'Chamastya76',
       'Undirra73', 'Aestysu37', 'Chadadarla74', 'Strithenu87',
       'Iasrira89', 'Ialidru40', 'Tyalaesu89', 'Tyidainu31', 'Lirtilsa72',
       'Undjaskla97', 'Saedaiphos46', 'Aerithnucal56', 'Lisossa46',
       'Layjask75', 'Lisista63', 'Ceoral34', 'Hilaerin92',
       'Chadilsasta32', 'Undassa89', 'Iduenu77', 'Lisosia66',
       'Undimsya85', 'Phaedue89', 'Yadacal26', 'Lisossa25', 'Ilmol66',
       'Yastyriaphos75', 'Hiasurria41', 'Palatyon26', 'Qilalista41',
       'Hada39', 'Chamilsala65', 'Rairith81', 'Ilarin91', 'Ryanara76',
       'Undista85', 'Tyeoralru41', 'Pheosrinudeu70', 'Heuli25',
       'Pheutherin27', 'Chadirra90', 'Ali84', 'Frichjaskan98', 'Malil90',
       'Yarithllodeu72', 'Tyaedainu44', 'Ethron58', 'Eusurdeu49',
       'Saistyphos30', 'Saisrilis27', 'Hallysucal81', 'Ilimya66',
       'Raysistast71', 'Haedairiadru51', 'Tyananurgue44', 'Risty84',
       'Aerillorin70', 'Phistyn52', 'Yalo85', 'Chamirrasya33', 'Hiral75',
       'Isursti83', 'Bartassaya73', 'Aeda94', 'Quinarap53', 'Asur53',
       'Alarap40', 'Sida61', 'Hiarideu73', 'Lassassasda30', 'Ennoncil86',
       'Siralsudeu54', 'Eusri26', 'Ardcil81', 'Marilsasya33', 'Lirtim36',
       'Heunadil74', 'Frichadar89', 'Aesurstilis64', 'Idaidil28',
       'Lisotesta51', 'Lisico81', 'Lisiriya82', 'Siana77', 'Marokian45',
       'Sausosia74', 'Assesi91', 'Eusri70', 'Aisurria69', 'Iarilis73',
       'Raisty38', 'Ilista82', 'Leyirra83', 'Aiduesu86', 'Frichynde86',
       'Hisridru55', 'Chamossa77', 'Irillo49', 'Lirtastsya71',
       'Frichosiala98', 'Qilunan34', 'Quarrion42', 'Aisurdru79',
       'Hiaral50', 'Iarallo65', 'Sondassasya91', 'Chanossast57',
       'Chanjask65', 'Ethralista69', 'Sondistanya61', 'Eudanu32',
       'Euthe35', 'Lassimla92', 'Lisossala30', 'Eulae84', 'Chamadarnya73',
       'Eolan54', 'Assistasda90', 'Ennrian78', 'Undirrasta89',
       'Rianistast50', 'Undare39', 'Adairialis76', 'Aesur96',
       'Tyialisudeu65', 'Arirgue63', 'Sundadarla27', 'Eyircil84', 'Ina92',
       'Lirtistanya48', 'Marassa62', 'Mindossa76', 'Salilis27',
       'Sondossa69', 'Sundjask71', 'Errian63', 'Eurithphos97',
       'Raillydeu47', 'Malon70', 'Jiskimsda56', 'Marughi89', 'Ingatcil75',
       'Chanirrasta87', 'Alaesu77', 'Ermol76', 'Tyeuduen32', 'Firon67',
       'Iadueria43', 'Pheulidil31', 'Eodairu79', 'Frichocesta66',
       'Thourdirra92', 'Chanastnya43', 'Iskim96', 'Eulolis41',
       'Sastydeu50', 'Ilaesudil92', 'Yasur85', 'Aidain51',
       'Aerithnuphos61', 'Yalostiphos68', 'Meosridil82', 'Aillyriadru65',
       'Sally64', 'Lisim51', 'Isurria36', 'Silaera56', 'Leetirraya83',
       'Lirtirra81', 'Eryon48', 'Iana95', 'Sondassan80', 'Chanadar44',
       'Eosurdru76', 'Shidai42', 'Aesri53', 'Syally44', 'Jiskadarst60',
       'Sondadar26', 'Malarrian73', 'Maluncil97', 'Ilunyon70', 'Yadam35',
       'Dyally87', 'Pheosurllorin41', 'Frichaya88', 'Lassadarsda57',
       'Marynde90', 'Isri34', 'Assastnya25', 'Ardonmol96',
       'Lassirrasda85', 'Chadossa56', 'Poshilsa82', 'Yoishirrala98',
       'Sundista37', 'Ilassa51', 'Filurarn35', 'Phaestycal84', 'Irilis75',
       'Aeralstical35', 'Chanirrala39', 'Chanirra79', 'Assirra56',
       'Seolollo93', 'Iathem87', 'Iasurriacal29', 'Lisast98', 'Filrion59',
       'Halaecal66', 'Iskosian40', 'Ilastilis78', 'Seosrim97',
       'Farrian71', 'Rithe53', 'Frichossala54', 'Chamjaskya75',
       'Quanrion96', 'Tyaelaelis94', 'Quanenrian83', 'Chanirra64',
       'Yadaisuir65', 'Syathecal44', 'Arin32', 'Aelaria33', 'Assassa81',
       'Filrion83', 'Eoral49', 'Airi27', 'Eurisuru25', 'Liawista80',
       'Lisirra58', 'Chamadarsda63', 'Haestyphos66', 'Phaedasurap84',
       'Mindimnya67', 'Chadjask85', 'Eustyria89', 'Iskim66', 'Chamast86',
       'Lirtassan78', 'Ethrasyon38', 'Quilassa66', 'Lisassasda39',
       'Mindilsa60', 'Lalossa38', 'Chamistast30', 'Hariphos58',
       'Assilsan72', 'Inasuir29', 'Chanilsasda38', 'Mindesi74',
       'Ililsan66', 'Idacal95', 'Aeral68', 'Tyarithn67', 'Asty82',
       'Yalaeria91', 'Chadjask77', 'Ealiril69', 'Quaecjask96',
       'Firatan58', 'Yarolwen77', 'Tyaelistidru84', 'Yarithrin84',
       'Tyaelly53', 'Phiristi62', 'Ililsasya43', 'Aithelis62',
       'Undotesta33', 'Aelidru27', 'Chanossanya44', 'Maradarnya40',
       'Lisilsa62', 'Saena89', 'Chanilsast61', 'Sundassa93', 'Aidai73',
       'Indirrian56', 'Lisassasta50', 'Iduelis31', 'Chanosiaya39',
       'Assylla81', 'Aidaira26', 'Eudanu84', 'Chamiman85', 'Tyialisti80',
       'Marundi65', 'Eusur90', 'Mindirranya33', 'Phiallylis33', 'Isty55',
       'Frichilsa31', 'Chanista95', 'Aellyria80', 'Rastynusuir31',
       'Iljask75', 'Lisjaskan36', 'Mindjasksya61', 'Frichirranya75',
       'Ilast79', 'Eratiel90', 'Assim27', 'Irith83', 'Ilosian36',
       'Iskossasda43', 'Hala31', 'Jiskjask80', 'Aethedru70', 'Yathecal72',
       'Sisur91'], dtype=object)

In [23]:
# Counting the total number of unique players
total_players = pd.DataFrame(unique_players).count()

In [26]:
#Display the total number of players along with the Column "Total Players"

totalplayers = pd.DataFrame(total_players, columns = ['Total Players'])
totalplayers

   Total Players
0            576

In [34]:
# Average Price for all the game
average_price = game_data["Price"].mean()
print("Game Averge Price")
average_price

Game Averge Price

3.050987179487176

In [37]:
number_of_game_pur = game_data["Purchase ID"].value_counts()
sum_num_game_pur = number_of_game_pur.sum()
sum_num_game_pur

780

In [43]:
unique_items=game_data["Item Name"].unique()
total_unique_item=pd.DataFrame(unique_items).count()
total_unique_item

0    179
dtype: int64

In [44]:
total_revenue=game_data["Price"].sum()
total_revenue

2379.77

In [54]:
#Purchasing Analysis (Total)
purchasing_analysis={'Average_Price':average_price,
                    'Number Of Game Purchase': sum_num_game_pur,
                    'NUM of Unique Items': total_unique_item,
                    'Total Revenue':total_revenue}

In [55]:
purchasing_analysis_df=pd.DataFrame(purchasing_analysis)

In [56]:
purchasing_analysis_df

   Average_Price  Number Of Game Purchase  NUM of Unique Items  Total Revenue
0       3.050987                      780                  179        2379.77

In [76]:
#Gender Demographics
total_players=game_data["Gender"].count()
total_players

780

In [83]:
male_players=(game_data["Gender"]=='Male').sum()
print("Male Players ")
male_players

Male Players

652

In [121]:
percentage_male_players='{0:.2f}'.format((male_players/total_players)*100)
percentage_male_players

'83.59'

In [122]:
female_players=(game_data["Gender"]=='Female').sum()
print("female Players")
female_players

female Players

113

In [123]:
percentage_female_players='{0:.2f}'.format((female_players/total_players)*100)
percentage_female_players

'14.49'

In [124]:
other_players=(game_data["Gender"]=='Other / Non-Disclosed').sum()
print("other Players")
other_players

other Players

15

In [125]:
percentage_other_players='{0:.2f}'.format((other_players/total_players)*100)
percentage_other_players

'1.92'

In [126]:
 Gender_Demographics={'Gender':['Male','Female','Others'],
                     'Total Count':[male_players,female_players,other_players],
                     'Percentage': [percentage_male_players,percentage_female_players,percentage_other_players]}

In [127]:
Gender_Demographics_table=pd.DataFrame(Gender_Demographics)
Gender_Demographics_table

   Gender  Total Count Percentage
0    Male          652      83.59
1  Female          113      14.49
2  Others           15       1.92

In [128]:
genders = game_data["Gender"].unique()
genders

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [129]:
game_count = game_data["Purchase ID"].sum()
game_count

303810

In [130]:
gender_purchases = game_data.groupby('Gender').agg({'Purchase ID':'count'})
gender_purchases

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [131]:
average_purchases = game_data.groupby('Gender').agg({'Price':'mean'})
average_purchases_format = average_purchases.applymap("${0:.2f}".format)
average_purchases_format

                       Price
Gender
Female                 $3.20
Male                   $3.02
Other / Non-Disclosed  $3.35

In [132]:
total_purchases = game_data.groupby('Gender').agg({'Price':'sum'})
total_purchases_format = total_purchases.applymap("${0:.2f}".format)
total_purchases_format

                          Price
Gender
Female                  $361.94
Male                   $1967.64
Other / Non-Disclosed    $50.19

In [134]:
sn = game_data.groupby(['SN','Gender']).agg({'Price':'sum'})

In [135]:
sn_gender = sn.groupby('Gender').agg({'Price':'mean'})
sn_gender_format = sn_gender.applymap("${0:.2f}".format)
sn_gender_format

                       Price
Gender
Female                 $4.47
Male                   $4.07
Other / Non-Disclosed  $4.56

In [136]:

purchasing_gender_analysis_2 = pd.concat([gender_purchases, average_purchases_format,total_purchases_format, sn_gender_format], axis=1)
purchasing_gender_analysis_2

                       Purchase ID  Price     Price  Price
Gender
Female                         113  $3.20   $361.94  $4.47
Male                           652  $3.02  $1967.64  $4.07
Other / Non-Disclosed           15  $3.35    $50.19  $4.56

In [138]:
# Purchasing Analysis (Gender)
purchasing_gender_analysis_2.columns = ['Purchase Count', 'Average Purchase Price','Total Purchase Value','Avg Total Purchase per Person']
purchasing_gender_analysis_2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [139]:
#Age analysis
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [141]:
age_bin = pd.cut(game_data["Age"], bins, labels=group_names)
age_bin

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [142]:
age_bins_df = pd.DataFrame(age_bin)
age_bins_df

       Age
0    20-24
1      40+
2    20-24
3    20-24
4    20-24
..     ...
775  20-24
776  20-24
777  20-24
778    <10
779  20-24

[780 rows x 1 columns]

In [145]:
age_group = age_bins_df.groupby("Age")
age_group_count = age_group["Age"].count()
age_group_count

Age
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [146]:
total_people = age_group.sum()
total_people

Empty DataFrame
Columns: []
Index: [<10, 10-14, 15-19, 20-24, 25-29, 30-34, 35-39, 40+]

In [147]:
age_group_count_df = pd.DataFrame(age_group_count)
age_group_count_df

       Age
Age
<10     23
10-14   28
15-19  136
20-24  365
25-29  101
30-34   73
35-39   41
40+     13

In [148]:
age_group_count_df.columns = ['Total Count']
age_group_count_df

       Total Count
Age
<10             23
10-14           28
15-19          136
20-24          365
25-29          101
30-34           73
35-39           41
40+             13

In [149]:
age_group_count_df["Percentage of Players"] = age_group_count_df["Total Count"]/age_group_count_df["Total Count"].sum()*100
age_group_count_df

       Total Count  Percentage of Players
Age
<10             23               2.948718
10-14           28               3.589744
15-19          136              17.435897
20-24          365              46.794872
25-29          101              12.948718
30-34           73               9.358974
35-39           41               5.256410
40+             13               1.666667

In [151]:
game_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [152]:
game_data["Ranges"] = pd.cut(game_data["Age"], bins, labels = group_names)
game_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,101,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [153]:
age_purchase_data = game_data.groupby(['Ranges'])

purchase_count = age_purchase_data['Purchase ID'].count()
purchase_count

Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [154]:
total_purchase = age_purchase_data['Price'].sum()
total_purchase

Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [156]:
players = game_data.drop_duplicates(subset ='SN').groupby(['Ranges'])
players = players['SN'].count()
players

Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [157]:
purchase_age = pd.DataFrame(age_purchase_data['Purchase ID'].count())
purchase_age

        Purchase ID
Ranges
<10              23
10-14            28
15-19           136
20-24           365
25-29           101
30-34            73
35-39            41
40+              13

In [158]:
purchase_age = purchase_age.rename(columns = {'Purchase ID':'Purchase Count'})
purchase_age

        Purchase Count
Ranges
<10                 23
10-14               28
15-19              136
20-24              365
25-29              101
30-34               73
35-39               41
40+                 13

In [159]:
purchase_age['Average Purchase Price'] = round((total_purchase/purchase_count),2)
purchase_age

        Purchase Count  Average Purchase Price
Ranges
<10                 23                    3.35
10-14               28                    2.96
15-19              136                    3.04
20-24              365                    3.05
25-29              101                    2.90
30-34               73                    2.93
35-39               41                    3.60
40+                 13                    2.94

In [160]:
purchase_age['Total Purchase Value'] = total_purchase
purchase_age

        Purchase Count  Average Purchase Price  Total Purchase Value
Ranges
<10                 23                    3.35                 77.13
10-14               28                    2.96                 82.78
15-19              136                    3.04                412.89
20-24              365                    3.05               1114.06
25-29              101                    2.90                293.00
30-34               73                    2.93                214.00
35-39               41                    3.60                147.67
40+                 13                    2.94                 38.24

In [161]:
purchase_age['Avg Total Purchase Per Person'] = round((total_purchase/players),2)
purchase_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
Ranges,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [162]:

grouped_by_sn_count_mean = game_data.groupby('SN').agg({'Price': ['count']})

In [163]:

grouped_by_sn_count_mean.columns = ['Total Count']

In [164]:

grouped_by_sn_count_mean.sort_values('Total Count', ascending=False).head()

             Total Count
SN
Lisosia93              5
Iral74                 4
Idastidru52            4
Asur53                 3
Inguron55              3

In [165]:
grouped_by_sn_count_mean2 = game_data.groupby('SN').agg({'Price': ['count', 'mean', 'sum']})

In [166]:
grouped_by_sn_count_mean2.columns = grouped_by_sn_count_mean2.columns.droplevel(0)

In [167]:
grouped_by_sn_final = grouped_by_sn_count_mean2.sort_values(['count','mean'], ascending=False).head()
grouped_by_sn_final

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Iral74           4  3.405000  13.62
Chamjask73       3  4.610000  13.83
Iskadarya95      3  4.366667  13.10

In [168]:
grouped_by_sn_final.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']
grouped_by_sn_final

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Iral74                    4                3.405000                 13.62
Chamjask73                3                4.610000                 13.83
Iskadarya95               3                4.366667                 13.10

In [170]:
# Populat item
groupby_items = game_data.groupby(['Item ID','Item Name', 'Price']).agg({'Price': ['count','sum']})

In [171]:
groupby_items.columns = groupby_items.columns.droplevel(0)

In [172]:
groupby_items_final = groupby_items_sorted_by_count = groupby_items.sort_values('count', ascending=False)

In [174]:
groupby_items_final.head()

                                                            count    sum
Item ID Item Name                                    Price
178     Oathbreaker, Last Hope of the Breaking Storm 4.23      12  50.76
145     Fiery Glass Crusader                         4.58       9  41.22
108     Extraction, Quickblade Of Trembling Hands    3.53       9  31.77
82      Nirvana                                      4.90       9  44.10
19      Pursuit, Cudgel of Necromancy                1.02       8   8.16

In [175]:
groupby_items_sum = groupby_items.sort_values('sum', ascending=False)

In [177]:
groupby_items_sum.head(5)

                                                            count    sum
Item ID Item Name                                    Price
178     Oathbreaker, Last Hope of the Breaking Storm 4.23      12  50.76
82      Nirvana                                      4.90       9  44.10
145     Fiery Glass Crusader                         4.58       9  41.22
92      Final Critic                                 4.88       8  39.04
103     Singed Scalpel                               4.35       8  34.80